---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.Camera.UpDirection
source: html/4bfed310-45bd-aeed-23ed-c49098809d2a.htm
---
# Autodesk.Revit.DB.DirectContext3D.Camera.UpDirection Property

Up direction of the camera

## Syntax (C#)
```csharp
public XYZ UpDirection { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null